УТ/src/InformationRegisters/CRM_ЗапланированныеАктивности/CRM_ЗапланированныеАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗапланированныеАктивности</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАктивности</name>
    <type>
      <types>EnumRef.CRM_ТипыАктивности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланируемаяАктивность</name>
    <type>
      <types>DocumentRef.CRM_Взаимодействие</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Documents/CRM_Взаимодействие/CRM_Взаимодействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Взаимодействие</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОфиса</name>
    <type>
      <types>CatalogRef.CRM_АдресаОфисовКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаимодействия</name>
    <type>
      <types>CatalogRef.CRM_ВидыВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ГостиМогутВидетьСписокГостей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГостиМогутИзменятьМероприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГостиМогутПриглашатьДругихГостей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияВзаимодействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.CRM_ОбъектыВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершившийПользователь</name>
    <comment>Завершивший пользователь</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <comment>АПК:1208 имя корректное</comment>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененоВРяде</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Место</name>
    <comment>Место</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаВесьДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяВыручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизаторGApi</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
      <types>String</types>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКатегория</name>
    <type>
      <types>CatalogRef.CRM_Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйПосетитМероприятие</name>
    <comment>Ответственный примет участие в мероприятии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодическое</name>
    <comment>Периодическое</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗавершение</name>
    <comment>Используется только в календаре, для управления длительностью взаимодействия</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <comment>Помещение для мероприятия</comment>
    <type>
      <types>CatalogRef.CRM_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотенциальныйКлиент</name>
    <type>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РассылатьОповещенияПриУдалении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассылатьУведомленияПоНастройке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассылатьУведомленияПриИзменении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассылатьУведомленияПриСоздании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РядСобытий</name>
    <type>
      <types>CatalogRef.CRM_РядыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокКлиентов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВзаимодействия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема взаимодействия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолготаЗавершенияВстречи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиротаЗавершенияВстречи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПосещениеПодтверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЧекЛиста</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныЧекЛистаВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СторонниеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотенциальныйКлиент</name>
      <type>
        <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьПоПочте</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьСМС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАдреса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Принадлежность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПосетитМероприятие</name>
      <comment>Примет участие в мероприятии</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресОфиса</name>
      <type>
        <types>CatalogRef.CRM_АдресаОфисовКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвоиЛица</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лицо</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьНапоминания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьПоПочте</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтправлятьСМС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПосетитМероприятие</name>
      <comment>Примет участие в мероприятии</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАдреса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Принадлежность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.CRM_Категории</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПодтвержденияВыполнения</name>
      <type>
        <types>EnumRef.CRM_ВидыПодтвержденияЧекЛиста</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненоИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ/src/InformationRegisters/CRM_ЗапланированныеАктивности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция - Следующая запланированная активность
//  Функция возвращает информацию о следующем взаимодействии или задаче выбранного интереса.
//
// Параметры:
//  Объект			- Ссылка, ДокументСсылка.CRM_Интерес			- Ссылка на интерес, 
//					по которому проверяются следующие запланированные активности.
//  ТипАктивности	- Ссылка, ПеречислениеСсылка.CRM_ТипыАктивности - Ссылка на тип активности, 
//					задача или взаимодействие.
// 
// Возвращаемое значение:
//  Результат		- Структура значений реквизитов записи регистра.
//  	ПланируемаяАктивность	- Ссылка,ДокументСсылка.CRM_Взаимодействие, ЗадачаСсылка.ЗадачаИсполнителя
//  	Ответственный	- Ссылка,СправочникСсылка.РолиИсполнителей, СправочникСсылка.Пользователи
//  	Тема			- Строка
//  	ПланируемаяДата	- Дата
//  	ТипАктивности	- ПеречислениеСсылка.CRM_ТипыАктивности
//
Функция СледующаяЗапланированнаяАктивность(Объект, ТипАктивности = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяАктивность КАК ПланируемаяАктивность,
	                      |	CRM_ЗапланированныеАктивности.Ответственный КАК Ответственный,
	                      |	CRM_ЗапланированныеАктивности.Тема КАК Тема,
	                      |	CRM_ЗапланированныеАктивности.ТипАктивности КАК ТипАктивности,
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяДата КАК ПланируемаяДата
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ЗначениеЗаполнено(ТипАктивности) Тогда
		Запрос.УстановитьПараметр("ТипАктивности", ТипАктивности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("ПланируемаяАктивность, Ответственный, Тема, ПланируемаяДата, ТипАктивности");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция - Есть активности к завершению
//
// Параметры:
//  Объект			 - Ссылка, ДокументСсылка.CRM_Интерес							 - Ссылка на интерес,
//  							по которому проверяются наличие активности к завершению.
//  ТипАктивности	 - Ссылка, ПеречислениеСсылка.CRM_ТипыАктивности				 - Ссылка на тип активности,
//  				задача или взаимодействие.
//  ОтборЗавершаемых - Ссылка, ПеречислениеСсылка.CRM_ОтборыЗавершаемыхАктивностей	 - Ссылка на тип отбора по регистру.
// 
// Возвращаемое значение:
//  Булево - Признак наличия задач или взаимодействия готовых к завершению.
//
Функция ЕстьАктивностиКЗавершению(Объект, ТипАктивности = Неопределено, ОтборЗавершаемых) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяАктивность КАК ПланируемаяАктивность
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |	И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату
	                      |	И ВЫБОР
	                      |			КОГДА CRM_ЗапланированныеАктивности.ПланируемаяАктивность ССЫЛКА Задача.ЗадачаИсполнителя
	                      |				ТОГДА CRM_ЗапланированныеАктивности.ПланируемаяАктивность.CRM_Личная
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяДата");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ЗначениеЗаполнено(ТипАктивности) Тогда
		Запрос.УстановитьПараметр("ТипАктивности", ТипАктивности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности", "");
	КонецЕсли;
	Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПросроченныеИНаСегодня Тогда
		ЗавершатьПоДату = КонецДня(ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ЗавершатьПоДату", ЗавершатьПоДату);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату", "");
	КонецЕсли;
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Процедура - Завершить активности
//  Процедура переводит задачу или взаимодействие в статус "Завершено".
//
// Параметры:
//  Объект			 - Ссылка, ДокументСсылка.CRM_Интерес							 - Ссылка на интерес, который необходимо завершить.
//  Результат		 - Строка														 - Описание результата выполнения процедуры.
//  ТипАктивности	 - Ссылка, ПеречислениеСсылка.CRM_ТипыАктивности				 - Ссылка на тип активности, задача
	// или взаимодействие.
//  ОтборЗавершаемых - Ссылка, ПеречислениеСсылка.CRM_ОтборыЗавершаемыхАктивностей	 - Ссылка на тип отбора по регистру.
//
Процедура ЗавершитьАктивности(Объект, Результат = "", ТипАктивности = Неопределено, ОтборЗавершаемых) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяАктивность КАК ПланируемаяАктивность
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |	И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату
	                      |ОБЪЕДИНИТЬ
	                      |ВЫБРАТЬ
	                      |CRM_Взаимодействие.Ссылка
	                      |ИЗ
	                      |РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	                      |	ПО CRM_ЗапланированныеАктивности.ПланируемаяАктивность = CRM_Взаимодействие.ДокументОснование
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |	И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ЗначениеЗаполнено(ТипАктивности) Тогда
		Запрос.УстановитьПараметр("ТипАктивности", ТипАктивности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности", "");
	КонецЕсли;
	Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПросроченныеИНаСегодня Тогда
		ЗавершатьПоДату = КонецДня(ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ЗавершатьПоДату", ЗавершатьПоДату);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ПланируемаяАктивность) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
			ПланируемаяАктивность = Выборка.ПланируемаяАктивность.ПолучитьОбъект();
			ПланируемаяАктивность.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено;
			ПланируемаяАктивность.Результат = ?(ЗначениеЗаполнено(Результат), Результат,
				 НСтр("ru='Завершено автоматически';en='Completed Automatically'"));
			ПланируемаяАктивность.ДатаЗавершенияВзаимодействия = ТекущаяДатаСеанса();
			ПланируемаяАктивность.Записать();
		ИначеЕсли ТипЗнч(Выборка.ПланируемаяАктивность) = Тип("ЗадачаСсылка.ЗадачаИсполнителя")
			 И Выборка.ПланируемаяАктивность.CRM_Личная Тогда
			ПланируемаяАктивность = Выборка.ПланируемаяАктивность.ПолучитьОбъект();
			ПланируемаяАктивность.Выполнена = Истина;
			ПланируемаяАктивность.РезультатВыполнения = ?(ЗначениеЗаполнено(Результат), Результат,
				 НСтр("ru='Завершена автоматически';en='Finished automatically'"));
			ПланируемаяАктивность.Записать();
		КонецЕсли;
		Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПерваяЗапланированная Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура - Завершить активности
//  Завершает взаимодействия по интересу в зависимости от настроек состояния интереса.
//
// Параметры:
//  Интерес			 - Ссылка, ДокументСсылка.CRM_Интерес			 - Ссылка на интерес, который необходимо завершить.
//  СостояниеИнтереса - Ссылка, СправочникСсылка.CRM_СостоянияИнтересов 					
//
Процедура ЗавершитьАктивностиИнтересаПоНастройкамСостояния(Интерес, СостояниеИнтереса) Экспорт
	Если ЗначениеЗаполнено(СостояниеИнтереса.ЗавершатьЗапланированныеАктивности) Тогда
		Если СостояниеИнтереса.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.Взаимодействия Тогда
			ТипАктивности = Перечисления.CRM_ТипыАктивности.Взаимодействие;
		ИначеЕсли СостояниеИнтереса.ЗавершатьЗапланированныеАктивности = Перечисления.CRM_ЗавершаемыеТипыАктивности.Задачи Тогда
			ТипАктивности = Перечисления.CRM_ТипыАктивности.Задача;
		Иначе
			ТипАктивности = Неопределено;
		КонецЕсли;
		ЗавершитьАктивности(Интерес, "", ТипАктивности,	СостояниеИнтереса.ОтборЗавершаемыхАктивностей);
	КонецЕсли;
КонецПроцедуры

// Процедура - Отменить активности
//
// Параметры:
//  Объект			 - Ссылка, ДокументСсылка.CRM_Интерес							 - Ссылка на интерес,
//  																				   по которому отменяются активности.
//  Результат		 - Строка														 - Результат выполнения процедуры
//  ТипАктивности	 - Ссылка, ПеречислениеСсылка.CRM_ТипыАктивности				 - Ссылка на тип активности,
//  																				   задача или взаимодействие.
//  ОтборЗавершаемых - Ссылка, ПеречислениеСсылка.CRM_ОтборыЗавершаемыхАктивностей	 - Ссылка на тип отбора по регистру.
//
Процедура ОтменитьАктивности(Объект, Результат, ТипАктивности = Неопределено, ОтборЗавершаемых = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяАктивность КАК ПланируемаяАктивность
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |	И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ЗначениеЗаполнено(ТипАктивности) Тогда
		Запрос.УстановитьПараметр("ТипАктивности", ТипАктивности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности", "");
	КонецЕсли;
	Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПросроченныеИНаСегодня Тогда
		ЗавершатьПоДату = КонецДня(ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ЗавершатьПоДату", ЗавершатьПоДату);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ПланируемаяАктивность) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
			ПланируемаяАктивность = Выборка.ПланируемаяАктивность.ПолучитьОбъект();
			ПланируемаяАктивность.ДатаЗавершенияВзаимодействия = ТекущаяДатаСеанса();
			ПланируемаяАктивность.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено;
			ПланируемаяАктивность.Результат = Результат;
			ПланируемаяАктивность.Записать();
		ИначеЕсли ТипЗнч(Выборка.ПланируемаяАктивность) = Тип("ЗадачаСсылка.ЗадачаИсполнителя")
			 И Выборка.ПланируемаяАктивность.CRM_Личная Тогда
			ПланируемаяАктивность = Выборка.ПланируемаяАктивность.ПолучитьОбъект();
			ПланируемаяАктивность.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПерваяЗапланированная Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Функция возвращает Истина, если нет необходимости в планировании обязательной активности.
//
// Параметры:
//  Интерес				 - ДокументСсылка.CRM_Интерес	 - Ссылка на документ "Интерес".
//  НовоеСостояние		 - СправочникСсылка.CRM_СостоянияИнтересов	 - Состояние интереса.
//  ТекстПредупреждения	 - Строка	 - Текст предупреждения.
// 
// Возвращаемое значение:
//   - Булево
//
Функция ПроверитьОбязательноеПланированиеАктивности(Интерес, НовоеСостояние, ТекстПредупреждения) Экспорт
	
	Если ЗначениеЗаполнено(НовоеСостояние.ОбязательноеПланированиеАктивности) Тогда
		Если НовоеСостояние.ОбязательноеПланированиеАктивности = 
				Перечисления.CRM_ПланируемыеТипыАктивности.ВзаимодействиеИЗадача Тогда
			Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Интерес,
			Перечисления.CRM_ТипыАктивности.Взаимодействие); 
			РезультатПроверки = Истина;
			Если Результат = Неопределено Тогда
				ТекстПредупреждения = 
					НСтр("ru = 'Нет запланированных взаимодействий по обращению. Переход в состояние невозможен.'");
				Возврат Ложь;
			КонецЕсли;
			Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Интерес,
			Перечисления.CRM_ТипыАктивности.Задача); 
			Если Результат = Неопределено Тогда
				ТекстПредупреждения = НСтр("ru = 'Нет запланированных задач по обращению. Переход в состояние невозможен.'");
				Возврат Ложь;
			КонецЕсли;
			Возврат Истина;
		ИначеЕсли НовоеСостояние.ОбязательноеПланированиеАктивности =
				Перечисления.CRM_ПланируемыеТипыАктивности.Взаимодействие Тогда
			ТипАктивности = Перечисления.CRM_ТипыАктивности.Взаимодействие;
			ТекстПредупреждения =
			НСтр("ru='Нет запланированных взаимодействий по текущему обращению. Переход в состояние невозможен!';
			|en='There will be no planned interactions for the current lead. You can not record a document!'");
		ИначеЕсли НовоеСостояние.ОбязательноеПланированиеАктивности = 
				Перечисления.CRM_ПланируемыеТипыАктивности.Задача Тогда
			ТипАктивности = Перечисления.CRM_ТипыАктивности.Задача;
			ТекстПредупреждения = НСтр("ru='Нет запланированных задач по текущему обращению. Переход в состояние невозможен.';
			|en='There are no scheduled tasks for the current lead. You can not record a document!'");
		Иначе 
			ТипАктивности = Неопределено;
			ТекстПредупреждения = НСтр("ru='Нет запланированных дел по текущему обращению. Переход в состояние невозможен.';
			|en='There are no scheduled activities for the current lead. You can not record a document!'");
		КонецЕсли;
		Результат = РегистрыСведений.CRM_ЗапланированныеАктивности.СледующаяЗапланированнаяАктивность(Интерес, ТипАктивности); 
		Если Результат = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина
	
КонецФункции
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидФормы = "ФормаЗаписи" Тогда
		СтандартнаяОбработка = Ложь;
		Параметры.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Параметры.Вставить("ТолькоПросмотр", Ложь);
		Если ТипЗнч(Параметры.Ключ) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
			Если ВзаимодействиеЗавершеноИлиОтменено(Параметры.Ключ) Тогда
				Параметры.Вставить("ОткрыватьФорму", Истина);
				ВыбраннаяФорма = "Документ.CRM_Взаимодействие.Форма.ФормаДокумента";
			Иначе
				ВыбраннаяФорма = "Документ.CRM_Взаимодействие.Форма.ФормаДокументаКраткая";
			КонецЕсли;
		ИначеЕсли ТипЗнч(Параметры.Ключ) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
			Параметры.Вставить("ИзСпискаАктивностей", Истина);
			CRM_МетодыМодулейМенеджеровЗадач.ОбработкаПолученияФормОбъектовCRM(Задачи.ЗадачаИсполнителя,
				 "ФормаОбъекта", Параметры, ВыбраннаяФорма, ДополнительнаяИнформация,
				 СтандартнаяОбработка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ВзаимодействиеЗавершеноИлиОтменено(ВзаимодействиеСсылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Взаимодействие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СостоянияСобытий
	|		ПО Взаимодействие.СтатусВзаимодействия = СостоянияСобытий.Ссылка
	|			И Взаимодействие.Ссылка = &ВзаимодействиеСсылка
	|			И (СостоянияСобытий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Отменено)))");
	
	Запрос.Параметры.Вставить("ВзаимодействиеСсылка", ВзаимодействиеСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
